# Intro to Pandas

Pandas is a high-level data manipulation package which was built on top of Numpy. The key structures within pandas include Series and Dataframes.

## Series

A series is a one-dimensional array with axis labels (an index).

In [1]:
# Importing libraries and packages

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# Creating a Series from a list
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
# We can access different components separately:

In [5]:
#Accessing the index
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# Accessing values

In [7]:
x.values

array([10, 20, 30, 40, 50])

In [8]:
# Accessing the dtype

In [9]:
# A Series is an ndarray, thus it's homogenous and CANNOT store multiple dtypes

In [10]:
x.dtype

dtype('int64')

In [11]:
# Creating a Series with an Index
data = [450, 650, 870]
Sales = Series(data, index=["Don", "Mike", "Edwin"])
Sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [12]:
# Check the type
type(Sales)

pandas.core.series.Series

In [13]:
# If we check the index of Sales, we will get the values, rather than the range. Because it's a string.
Sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

## Accessing Values

In [14]:
# You can access values using the index name
Sales["Don"]

450

In [15]:
#You can still use traditional indexing

In [16]:
Sales[0]

/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/925086647.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Sales[0]

450

## Checking for conditions

In [17]:
# You can filter based on conditions.

In [19]:
Sales > 500
#This will usually return booleans

Don      False
Mike      True
Edwin     True
dtype: bool

In [20]:
# We can use these booleans

In [21]:
Sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [22]:
# If we want to see values greater than 500, we can use booleans

In [23]:
Sales[Sales>500]

Mike     650
Edwin    870
dtype: int64

In [24]:
# False example

In [25]:
"Sally" in Sales

False

In [26]:
# What about this?

In [27]:
450 in Sales

False

In [28]:
#450 is not an index, it's a value. Thus it will return False.

# Working with Dictionaries

In [29]:
#Converting a Series to a dictionary
sales_dict = Sales.to_dict()

In [30]:
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [31]:
#Converting a dict to a series

In [32]:
sales_ser = Series(sales_dict)

In [33]:
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding entries and working with NaN/null values

In [34]:
# We can create a new Series from an existing Series

In [35]:
#If we specify names in the index that were NOT there already, NaN values will be asigned
new_sales = Series(Sales, index=["Don", "Mike", "Sally", "Edwin", "Lucy"])

In [36]:
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
Lucy       NaN
dtype: float64

In [37]:
# We can check if there are any NaN values in a Series
# For this we use Numpy!

In [38]:
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [39]:
#To check for null values, use Pandas!
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

### Naming components

In [43]:
# Name an index
Sales.index.name = "Sales person"
Sales

Sales person
Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

In [42]:
# Naming a Series
Sales.name = "Total tv sales"
Sales

Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

## DataFrames

DataFrames are two-dimensional, size-mutable, potentially heterogeneous tabular data structures...

## Creating a DataFrame

In [51]:
#Creating a DataFrame from a list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

#When we create a DataFrame, we can specify what the column names are and the data type is

df = pd.DataFrame(data, columns=["Name", "Age"])
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [53]:
#Creating a DF from a dictionary 
# Dictionary with sample data
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [30, 25, 35],
    "City": ["London", "Manchester", "Birmingham"],
    "Occupation": ["Engineer", "Doctor", "Artist"]
}

df = pd.DataFrame(data)
df

      Name  Age        City Occupation
0    Alice   30      London   Engineer
1      Bob   25  Manchester     Doctor
2  Charlie   35  Birmingham     Artist

In [54]:
# Custom indexes
custom_indexes = ["ID_101", "ID_102", "ID_103"]

In [55]:
df = pd.DataFrame(data, index=custom_indexes)
df

           Name  Age        City Occupation
ID_101    Alice   30      London   Engineer
ID_102      Bob   25  Manchester     Doctor
ID_103  Charlie   35  Birmingham     Artist

In [56]:
# List of dictionaries
data = [
    {"Name": "Alice", "Age": 30, "City": "London"},
    {"Name": "Bob", "Age": 25, "City": "Manchester"},
    {"Name": "Charlie", "Age": 35, "City": "Birmingham"}
]

# Creating a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age        City
0    Alice   30      London
1      Bob   25  Manchester
2  Charlie   35  Birmingham

In [57]:
# Creating a Series
series = pd.Series([30, 25, 35], index=["Alice", "Bob", "Charlie"], name="Age")

df = series.to_frame()
df

         Age
Alice     30
Bob       25
Charlie   35

In [62]:
data = [
    {"Name": "Alice", "Age": 30, "City": "London"},
    {"Name": "Bob", "Age": 25, "City": "Manchester"},
    {"Name": "Charlie", "Age": 35, "City": "Birmingham"}
]

df = pd.DataFrame(data)

# New Series
occupations = pd.Series(["Engineer", "Doctor", "Artist"], name="Occupation")

# Adding the Series as a new column to the DataFrame
df["Occupation"] = occupations
df

      Name  Age        City Occupation
0    Alice   30      London   Engineer
1      Bob   25  Manchester     Doctor
2  Charlie   35  Birmingham     Artist

In [64]:
# Original DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [30, 25, 35],
    "City": ["London", "Manchester", "Birmingham"]
}
df = pd.DataFrame(data)

df = df.set_index("Name")
df

         Age        City
Name
Alice     30      London
Bob       25  Manchester
Charlie   35  Birmingham

In [67]:
#How to fill missing values

# Sample DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, None, 35, None],
    "City": ["London", None, "Birmingham", "Manchester"]
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
print(df)
print("\n")

# 1. **Forward Fill (ffill)**
df_filled_ffill = df.fillna(method='ffill')

print("DataFrame with forward fill (ffill):")
print(df_filled_ffill)
print("\n")

# 2. **Backward Fill (bfill)**
df_filled_bfill = df.fillna(method='bfill')

print("DataFrame with backward fill (bfill):")
print(df_filled_bfill)

Original DataFrame:
      Name   Age        City
0    Alice  30.0      London
1      Bob   NaN        None
2  Charlie  35.0  Birmingham
3    David   NaN  Manchester


DataFrame with forward fill (ffill):
      Name   Age        City
0    Alice  30.0      London
1      Bob  30.0      London
2  Charlie  35.0  Birmingham
3    David  35.0  Manchester


DataFrame with backward fill (bfill):
      Name   Age        City
0    Alice  30.0      London
1      Bob  35.0  Birmingham
2  Charlie  35.0  Birmingham
3    David   NaN  Manchester

/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/3446857070.py:19: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df.fillna(method='ffill')
/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/3446857070.py:26: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_bfill = df.fillna(method='bfill')

In [68]:
# Sample DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, None, 35, None],
    "City": ["London", None, "Birmingham", "Manchester"]
}

df = pd.DataFrame(data)

# Forward Fill (ffill / pad)
df_filled_ffill = df.fillna(method='ffill')

print("Forward Fill (ffill / pad):")
print(df_filled_ffill)

Forward Fill (ffill / pad):
      Name   Age        City
0    Alice  30.0      London
1      Bob  30.0      London
2  Charlie  35.0  Birmingham
3    David  35.0  Manchester

/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/1878105491.py:11: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df.fillna(method='ffill')

In [69]:
# Backward Fill (bfill)
df_filled_bfill = df.fillna(method='bfill')

print("Backward Fill (bfill):")
print(df_filled_bfill)

Backward Fill (bfill):
      Name   Age        City
0    Alice  30.0      London
1      Bob  35.0  Birmingham
2  Charlie  35.0  Birmingham
3    David   NaN  Manchester

/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/3417611451.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_bfill = df.fillna(method='bfill')

In [70]:
# Forward Fill using 'pad' (same as 'ffill')
df_filled_pad = df.fillna(method='pad')

print("Forward Fill (pad):")
print(df_filled_pad)

Forward Fill (pad):
      Name   Age        City
0    Alice  30.0      London
1      Bob  30.0      London
2  Charlie  35.0  Birmingham
3    David  35.0  Manchester

/var/folders/65/jy4lt7y15c1bbj4rg1q8nnjh0000gn/T/ipykernel_33574/1147565701.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_pad = df.fillna(method='pad')

In [71]:
#Interpolate
# Sample DataFrame with missing values (NaN)
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, None, 35, None]
}

df = pd.DataFrame(data)

# Interpolating to fill missing values in the 'Age' column
df["Age"] = df["Age"].interpolate()

print(df)

      Name   Age
0    Alice  30.0
1      Bob  32.5
2  Charlie  35.0
3    David  35.0

In [72]:
#Drop rows
# Sample DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, 25, 35, 40],
    "City": ["London", "Manchester", "Birmingham", "London"]
}

df = pd.DataFrame(data)

# Drop row with index 1 (Bob)
df_dropped_row = df.drop(1)

print(df_dropped_row)

      Name  Age        City
0    Alice   30      London
2  Charlie   35  Birmingham
3    David   40      London

In [74]:
#Drop column
# Drop column 'City'
df_dropped_column = df.drop("City", axis=1)

print(df_dropped_column)

      Name  Age
0    Alice   30
1      Bob   25
2  Charlie   35
3    David   40

In [76]:
#Drop rows based on a threshold
# Sample DataFrame with missing values (NaN)
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, None, None, 40],
    "City": [None, "Manchester", "Birmingham", "London"]
}

df = pd.DataFrame(data)

# Drop rows where there are fewer than 2 non-null values
df_dropped_rows = df.dropna(thresh=2)

print(df_dropped_rows)

      Name   Age        City
0    Alice  30.0        None
1      Bob   NaN  Manchester
2  Charlie   NaN  Birmingham
3    David  40.0      London

In [77]:
#Drop based on an index
# Sample DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [30, 25, 35, 40],
    "City": ["London", "Manchester", "Birmingham", "London"]
}

df = pd.DataFrame(data)

# Drop row with index 1 (Bob) and index 3 (David)
df_dropped_rows = df.drop([1, 3])

print(df_dropped_rows)

      Name  Age        City
0    Alice   30      London
2  Charlie   35  Birmingham

In [79]:
#Drop duplicate rows
# Sample DataFrame with duplicate rows
data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", "David", "Bob"],
    "Age": [30, 25, 35, 30, 40, 25],
    "City": ["London", "Manchester", "Birmingham", "London", "London", "Manchester"]
}

df = pd.DataFrame(data)

# Remove duplicate rows
df_no_duplicates = df.drop_duplicates()

print(df_no_duplicates)

      Name  Age        City
0    Alice   30      London
1      Bob   25  Manchester
2  Charlie   35  Birmingham
4    David   40      London